(*

#use"Text_editing/french_data.ml";;

*)



let paired_data =
  [("a", "A"); ("à", "À"); ("á", "Á"); ("â", "Â"); ("ä", "Ä");

   ("b", "B"); ("c", "C"); ("d", "D"); 
   
   ("e", "E"); ("è", "È"); ("é", "É"); ("ê", "Ê"); ("ë", "Ë");   
   
   ("f", "F"); ("g", "G"); ("h", "H"); 
   
   ("i", "I"); ("ì", "Ì"); ("í", "Í"); ("î", "Î"); ("ï", "Ï");
   
   ("j", "J"); ("k", "K"); ("l", "L");("m", "M"); ("n", "N"); 
   
   ("o", "O"); ("ò", "Ò"); ("ó", "Ó"); ("ô", "Ô"); ("ö", "Ö");    
   
   ("p", "P"); ("q", "Q"); ("r", "R");("s", "S"); ("t", "T"); 
   
   ("u", "U"); ("ù", "Ù"); ("ú", "Ú"); ("û", "Û"); ("ü", "Ü");    
   
   ("v", "V"); ("w", "W"); ("x", "X");("y", "Y"); ("z", "Z");
   ];;

 let single_data = [" ";[";"]";"_";"-";"'";"#";"@"];;

 let chars_in_order=
   (Image.image fst paired_data)@(Image.image snd paired_data)@single_data;;  





